{
  "basics": {
    "name": "Veerav Naidu",
    "label": "Software Engineer",
    "picture": "https://media.licdn.com/dms/image/C4D03AQGOfnA5vslkrA/profile-displayphoto-shrink_100_100/0?e=1583366400&v=beta&t=WCGJeLIJn0_nH4zsbaBdAVlgbB-nIopIHwSkQhelZ9E",
    "email": "veeravn@gmail.com",
    "phone": "(763) 772-5969",
    "url": "http://www-scf.usc.edu/~vnaidu/",
    "summary": "Experienced and result oriented IT professional seeking a technology position focused on solution development, delivery and support in a fast paced environment.",
    "location": {
      "address": "15570 58th Pl N",
      "postalCode": "55446",
      "city": "Plymouth",
      "countryCode": "US",
      "region": "Minnesota"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "veerav-naidu",
        "url": "https://www.linkedin.com/in/veerav-naidu-9a147540/"
      }
    ]
  },
  "work": [
    {
      "name": "Optum",
      "location": "Minneapolis, MN",
      "description": "Awesome compression company",
      "position": "Software Engineer",
      "url": "https://optum.com",
      "startDate": "2018-02-26",
      "highlights": [
        "Administered the usage of Cassandra as a data store.",
        "Collaborated with other teams to build SpringBoot appliations to transform raw data into JSON documents and load them into Cassandra Database",
        "Leveraged Apache Kafka Streams to create an ETL (Extract, Transform, and Load) pipeline to ingest data for real time streaming on Container Platform or Kubernetes.",
        "Built Unit, Integration, and Regression tests for existing XQuery Rest APIs using Xray, Cucumber, and Groovy SpockFramework.",
        "Designed testing framework to run integration tests using Docker images that are started and stopped during Maven test phase.",
        "Built Rest API from scratch using Springboot, ElasticSearch, and Cassandra as Tech Stack"
      ]
    },
    {
      "name": "United States Postal Services",
      "location": "Eagan, MN",
      "description": "Awesome compression company",
      "position": "Computer Systems Analyst",
      "url": "https://usps.com",
      "startDate": "2013-08-12",
      "endDate": "2016-08-12",
      "highlights": [
        "Led development, upgrades, and support on various Java Web Applications: EAPS (Eagan Accounts Payable System) and EAWARDS (Electronic Award System).",
        "Enhanced the EAWARDS application to improve security and access to certain functionality by adding a new user role into EAWARDS to showcase a clear separation of duties between users.",
        "Modified EAPS back-end code structure from EJB 2.0 to EJB 3.0 with OpenJPA to improve development and release efficiency.",
        "Collaborated with other development teams to develop automated deployment scripts leveraging ANT or GRADLE build tools.",
        "Preformed back-end and front-end system testing in CBS (Corporate Budget System).",
        "Networked as an active member of Agile Scrum Teams, interacting with product owners and other Scrum developers."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Southern California",
      "area": "Computer Science",
      "studyType": "Masters",
      "startDate": "2016-08-15",
      "endDate": "2017-12-15",
      "courses": [
        "CSCI571 - Web Technologies",
        "CSCI572 - Information Retrieval and Search Engines",
        "CSCI577 - Software Engineering",
        "CSCI585 - Database Systems",
        "CSCI526 - Advanced Mobile Devices & Game Consoles"
      ]
    },
    {
      "institution": "Augsburg College",
      "area": "Computer Science",
      "studyType": "Bachelor",
      "startDate": "2009-09-02",
      "endDate": "2013-05-03",
      "courses": [
        "CS210 - Data Structures",
        "CS320 - Algorithms",
        "CS352 - Databases",
        "CS450 - Compilers"
      ]
    }
  ],
  "skills": [
    {
      "name": "BackEnd",
      "keywords": [
        "Java",
        "SQL",
        "J2EE",
        "Spring/SpringBoot",
        "Struts",
        "Hibernate",
        "JSON",
        "Rest API",
        "Apache Kafka",
        "Apache Kafka Streams",
        "Solr",
        "SteamVR",
        "Unity3D"
      ]
    },
    {
      "name": "FrontEnd",
      "keywords": [
        "Javascript",
        "HTML/CSS",
        "JQuery",
        "Angular",
        "AJAX",
        "Bootstrap",
        "Swift",
        "PHP"
      ]
    },
    {
      "name": "DevOps",
      "keywords": [
        "Git",
        "Subversion",
        "Jenkins",
        "Gradle",
        "AWS",
        "GCP",
        "Google Firebase",
        "OpenShift Container Platform",
        "Docker",
        "Kubernetes"
      ]
    },
    {
      "name": "DataStore Technologies",
      "keywords": [
        "Oracle DB",
        "Cassandra NOSQL DB",
        "ElasticSearch",
        "Google Cloud Firestore DB",
        "MarkLogic"
      ]
    },
    {
      "name": "Mobile Platform",
      "keywords": [
        "Android",
        "IOS"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    }
  ],
  "projects": [
    {
      "name": "Web Search Engine",
      "description": "Designed and developed a web search engine by crawling the web using crawler4j.",
      "highlights": [
        "Designed and developed a web search engine by crawling the web using crawler4j.",
        "Data collected by the crawler is indexed using Solr to which additional features like spell check, auto completion and page rank scoring were added.",
        "All the additional features have been implemented using custom dictionaries built speci cally for the downloaded data set to improve the precision and recall of the search results."
      ],
      "keywords": [
        "Lucene Search Engine",
        "Solr"
      ],
      "startDate": "2017-08-15",
      "endDate": "2017-12-15"
    },
    {
      "name": "Software Engineering",
      "description": "Led a team of 9 developers to design and build a native Android Application to help a person with Diabetes learn how to manage their condition better.",
      "highlights": [
        "Information about a user is collected at the time of registration.",
        "Uses input in the form of estimated blood sugar levels, amount of insulin taken, the type and quantity of food eaten per day to calculate when a patient’s blood sugar levels are too high or too low and the reason behind these spikes.",
        "Registration is done with Google Firebase and user data is managed by Google Cloud Firestore NOSQL DB.",
        "Uses the USDA Food Database API to allow the patient to search for and add food that they have or will eat to be taken into account for their calculations. For those using a Dexcom Continuous Glucose Monitor (CGM), the application can connect to your Dexcom account and use the estimated glucose values from your CGM to calculate the optimum blood sugar levels for you."
      ],
      "keywords": [
        "Google Cloud",
        "Firestore",
        "Firebase"
      ],
      "startDate": "2017-08-15",
      "endDate": "2017-12-15"
    },
    {
      "name": "Advanced Mobile Devices & Game Consoles",
      "description": "Led a team of 5 to design and build a Virtual Reality (VR) game to replicate a real environment and simulate a user’s physical presence in this environment",
      "highlights": [
        "Led a team of 5 to design and build a Virtual Reality (VR) game to replicate a real environment and simulate a user’s physical presence in this environment. VR is the medium through which emotion is ampli ed. Gaming is one of the areas in which VR is used. Fantasy Drive is the game which enhances the racing experience of the user with VR. The game’s aim is to simulate the remote control car experience in a VR setting. From our game, the audience will gain a real driving experience, which is a perfect practise for driving in the real life."
      ],
      "keywords": [
        "VR",
        "Virtual Reality",
        "C#",
        "Unity3D"
      ],
      "startDate": "2017-01-11",
      "endDate": "2017-05-05"
    },
    {
      "name": "Web Technologies",
      "highlights": [
        "Designed and developed a responsive website featuring congress search API results, using AJAX, JSON & XML technologies with a combination of HTML, CSS, DOM, PHP and JSON. Provided an interface built upon Bootstrap, jQuery UI, and Angular JS to perform congress search. The responsive website was hosted on AWS",
        "Developed an IOS app to provide information on Legislators, Bills, and Committees using Congress Search API. This project uses an Amazon EC2 instance as a remote server to which an app built using Xcode, IOS Swift App development and Facebook SDK for IOS communicates using AJAX requests."
      ],
      "keywords": [
        "HTML",
        "CSS",
        "Angular",
        "Swift",
        "PHP"
      ],
      "startDate": "2017-01-11",
      "endDate": "2017-05-05"
    }
  ],
  "meta": {
    "theme": "kendall"
  }
}